// pages/news/index.js
Page({
  /**
   * 页面的初始数据
   */
  data: {
    newlist:[
      {
        "id":1,
        "img":"../../../image/bg.png",
        "title":'2020年留学政策发布1',
        "text":"2020年留学2020年留学政策发布2020年留学政策发布2020年留学政策发布2020年留学政策发布政策发布2020年留学政策发布2020年留学政策发布2020年留学政策发布"
      },
      {
        "id":2,
        "img":"",
        "title":'2020年留学政策发布2',
        "text":"2020年留学2020年留学政策发布2020年留学政策发布2020年留学政策发布2020年留学政策发布政策发布2020年留学政策发布2020年留学政策发布2020年留学政策发布"
      },
      {
        "id":3,
        "img":"../../../image/bg.png",
        "title":'2020年留学政策发布3',
        "text":"2020年留学2020年留学政策发布2020年留学政策发布2020年留学政策发布2020年留学政策发布政策发布2020年留学政策发布2020年留学政策发布2020年留学政策发布"
      },
      {
        "id":4,
        "img":"",
        "title":'2020年留学政策发布4',
        "text":"2020年留学2020年留学政策发布2020年留学政策发布2020年留学政策发布2020年留学政策发布政策发布2020年留学政策发布2020年留学政策发布2020年留学政策发布"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})